import streamlit as st

# Page Title with Custom Style
st.markdown("""
    <h1 style='text-align: center; color: #2E7ABC;'>အကြောင်းအရာ</h1>
    <p style='text-align: right; font-style: italic; color: #555;'>အမျိုးသားဉာဏ်ရည်တုနည်းပညာဖွံ့ဖြိုးတိုးတက်ရေးစီမံကိန်း</p>
""", unsafe_allow_html=True)


# Content with Styling
st.markdown("""
<style>
    .content-box {
        background-color: #F9F9F9;
        padding: 20px;
        border-radius: 10px;
        box-shadow: 0 4px 8px rgba(0,0,0,0.1);
        line-height: 2.8;
        font-size: 16px;
        color: #333;
    }
    ul {
        margin-left: 20px;
    }
    li {
        margin-bottom: 12px;
        padding-bottom: 4px;
        border-bottom: 1px dashed #ccc; /* အောက်မှာအစင်းလေးဆွဲထားတာလို့ ထပ်ပြင်နိုင် */
    }

</style>

<div class="content-box">
    <ul>
        <li>မြန်မာစာဖွံ့ဖြိုးတိုးတက်ရေးစီမံကိန်းတွင် Natural Language Processing(NLP) (AI) နည်းပညာလုပ်ငန်းများကို အကြီးအကဲ၏ လမ်းညွှန်ချက်နှင့်အညီ အရှိန်အဟုန်မြှင့် ဆောင်ရွက်လျက်ရှိပါသည်။ ယင်းသို့ဆောင်ရွက်ရာတွင် NLP(AI) နည်းပညာလုပ်ငန်းစဉ်၌ မြန်မာနာမည်စာလုံးပေါင်းကို အင်္ဂလိပ်အက္ခရာဖလှယ်ခြင်းနည်းစနစ်ကို ဆောင်ရွက်ခြင်းသည်လည်း အဓိကလုပ်ငန်းစဉ်တစ်ရပ် ဖြစ်ပါသည်။၊</li>
        <li>မြန်မာအမည်နာမများအား အင်္ဂလိပ်ဘာသာဖြင့် ပြောင်းလဲရေးသားဖော်ပြရာတွင် အသံထွက်များအနီးစပ်ဆုံးမှန်ကန်မှုရှိစေရေးနှင့် အချိန်နေရာမရွေး တစ်သမတ်တည်းရှိစေရေးတို့သည် အစိုးရယန္တရားများအပါအဝင် ပုဂ္ဂလိက ကဏ္ဍအသီးသီးတို့၌ ဒစ်ဂျစ်တယ်စနစ်သို့ ကူးပြောင်း၍ အဆင့်မြင့်နည်းပညာနှင့် AI စနစ်များပေါင်းစပ် ထည့်သွင်းအသုံးပြုခြင်း၊ ဒေတာအချက်အလက်များအား ကိုင်တွယ်စီမံထိန်းသိမ်းခြင်းနှင့်မျှဝေခြင်း၊ ဆက်သွယ်ရေးသားပြောဆိုခြင်း စသည့်ကိစ္စရပ်များဆောင်ရွက်ရာ၌ အကျိုးများထိရောက်မှုရှိစေရန်အတွက် များစွာအရေးပါသော လိုအပ်ချက်တစ်ခုဖြစ်ပါသည်။</li>
        <li>NLP(AI) နည်းပညာလုပ်ငန်းဆောင်ရွက်ရန်အတွက် မြန်မာနာမည်စာလုံးပေါင်းတွင် အသုံးပြုသည့် ဗျည်း၊ သရအက္ခရာများကို အသံဆင်တူသည့် အင်္ဂလိပ်အက္ခရာများဖြင့် ဖလှယ်ရေးသားမည့် စာလုံးပေါင်းစနစ်ကို စံသတ်မှတ်မှုသည် အထူးအရေးကြီးပါသည်။ အဆိုပါ စံသတ်မှတ်ထားသော Myanmar Names ကို အသုံးပြု၍ Digital Space တွင် အရေးကြီးသော အချက်အလက်များစိစစ်ခြင်း၊ လုံခြုံရေးဝန်ဆောင်မှုပေးခြင်း၊ Data များလုံခြုံမှုရှိစွာ သိမ်းဆည်းခြင်း လုပ်ငန်းများကို ထိထိရောက်ရောက် အကောင်အထည်ဖော် ဆောင်ရွက်နိုင်မည်ဖြစ်ပါသည်။</li>
        <li>လက်ရှိတွင် အမည်နာမများအား အင်္ဂလိပ်ဘာသာသို့ ပြောင်းလဲရေးသားဖော်ပြရာ၌ တရားဝင်စံတစ်ခုထား၍ လိုက်နာကျင့်သုံးမှုမရှိသည့်အတွက် အမည်နာမတစ်ခုအား အင်္ဂလိပ်စာလုံးပေါင်းအမျိုးမျိုးဖြင့် ရေးသားဖော်ပြနေကြသည်ကို အထူးသဖြင့် လူပုဂ္ဂိုလ်အမည်များ၊ နိုင်ငံကူးလက်မှတ်များ၊ မြို့၊ ရွာများနှင့် လမ်းအမည်များတွင် တွေ့ရှိနေရပါသည်။</li>
        <li>ထို့အပြင် Digital Transformation အပိုင်းတွင်လည်း AI ၏ အခန်းကဏ္ဍက ကြီးမားလာပြီး AI-Driven Technologies များဖြစ်သည့် Natural Language Processing (NLP) and Translation၊ Search Engine and Information Retrieval၊ Automated Identity Verification၊ AI Moderation and Content Filtering၊ Voice Assistants and Chatbots စသည့်နည်းပညာများသည် ဒေတာအချက်အလက်များ၏ တစ်သတ်မတ်တည်းရှိမှု (consistency)အပေါ် များစွာမှီခိုလျက်ရှိနေသည်ဖြစ်ရာ မြန်မာအမည်နာမများအား အင်္ဂလိပ်ဘာသာဖြင့် ပြောင်းလဲရေးသားဖော်ပြရန် စံမရှိခြင်းသည် AI ကို အသုံးချ၍ မြန်မာဘာသာစကားဖွံ့ဖြိုးတိုးတက်ရေးကို လုပ်ဆောင်နိုင်မည့် အခွင့်အရေးကိုလည်း အဟန့်အတားဖြစ်စေနိုင်မည်ဖြစ်ပါသည်။</li>
        <li>သို့ဖြစ်ပါ၍ မြန်မာစာဖွံ့ဖြိုးတိုးတက်ရေးစီမံကိန်းက ပြုစုထားသည့် မြန်မာနာမည်စာလုံးပေါင်းကို အင်္ဂလိပ်အက္ခရာဖလှယ်ခြင်း (Romanization of Myanmar Names) စနစ်အား စံသတ်မှတ်ဆောင်ရွက်ခြင်းဖြစ်ကြောင်း တင်ပြအပ်ပါသည်။</li>
    </ul>
</div>
""", unsafe_allow_html=True)